# Aggregate and Numeric Functions

In [2]:
USE rookery;
SELECT COUNT(*)
FROM birds;

In [3]:
UPDATE birds
SET common_name = NULL
WHERE common_name = '';
SELECT COUNT(common_name)
FROM birds;

In [4]:
SELECT COUNT(*) FROM birds
WHERE common_name IS NULL;

In [5]:
SELECT COUNT(*) FROM birds
WHERE common_name IS NOT NULL;

In [6]:
SELECT COUNT(*)
FROM birds
GROUP BY family_id;

In [7]:
SELECT bird_families.scientific_name AS 'Bird Family',
COUNT(*) AS 'Number of Species'
FROM birds JOIN bird_families USING(family_id)
GROUP BY birds.family_id;

In [8]:
SELECT bird_families.scientific_name AS 'Bird Family',
COUNT(*) AS 'Number of Species'
FROM birds LEFT JOIN bird_families USING(family_id)
GROUP BY birds.family_id;

In [9]:
SELECT bird_families.scientific_name AS 'Bird Family',
COUNT(*) AS 'Number of Species'
FROM birds LEFT JOIN bird_families USING(family_id)
GROUP BY bird_families.scientific_name;

In [10]:
SELECT bird_families.scientific_name AS 'Bird Family',
COUNT(*) AS 'Number of Species'
FROM birds JOIN bird_families USING(family_id)
GROUP BY bird_families.scientific_name WITH ROLLUP;

In [11]:
SELECT IFNULL( bird_orders.scientific_name, '') AS 'Bird Order',
IFNULL( bird_families.scientific_name, 'Total:') AS 'Bird Family',
COUNT(*) AS 'Number of Species'
FROM birds
JOIN bird_families USING(family_id)
JOIN bird_orders USING(order_id)
GROUP BY bird_orders.scientific_name, bird_families.scientific_name
WITH ROLLUP;

In [12]:
SELECT common_name AS 'Bird',
TIME_TO_SEC( TIMEDIFF(id_end, id_start) )
 AS 'Seconds to Identify'
FROM bird_identification_tests
JOIN humans USING(human_id)
JOIN rookery.birds USING(bird_id)
WHERE name_first = 'Ricky' AND name_last = 'Adams';

ERROR 1146 (42S02): Table 'rookery.bird_identification_tests' doesn't exist

In [13]:
SELECT CONCAT(name_first, SPACE(1), name_last)
 AS 'Birdwatcher',
SUM(TIME_TO_SEC( TIMEDIFF(id_end, id_start) ) )
 AS 'Total Seconds for Identifications'
FROM bird_identification_tests
JOIN humans USING(human_id)
JOIN rookery.birds USING(bird_id)
WHERE name_first = 'Ricky' AND name_last = 'Adams';

ERROR 1146 (42S02): Table 'rookery.bird_identification_tests' doesn't exist

In [ ]:
SELECT Identifications, Seconds,
(Seconds / Identifications) AS 'Avg. Seconds/Identification'
FROM
 ( SELECT human_id, COUNT(*) AS 'Identifications'
 FROM bird_identification_tests
 JOIN humans USING(human_id)
 JOIN rookery.birds USING(bird_id)
 WHERE name_first = 'Ricky' AND name_last = 'Adams')
 AS row_count
 JOIN
 ( SELECT human_id, CONCAT(name_first, SPACE(1), name_last)
 AS 'Birdwatcher',
 SUM(TIME_TO_SEC(TIMEDIFF(id_end, id_start)))
 AS 'Seconds'
 FROM bird_identification_tests
 JOIN humans USING(human_id)
 JOIN rookery.birds USING(bird_id) )
 AS second_cou

### Summary

Although we didn’t cover all of the aggregate and numeric functions, we covered most
of them—including the ones that are used most often. We primarily skipped the statistics
functions. We didn’t cover many arithmetic functions, but those are pretty straightfor‐
ward (e.g., POWER(2, 8) returns 2 to the eighth power, or 256), or they’re specialized
(e.g., PI( ) returns π, or 3.141593). What’s important is that you feel comfortable with
aggregate functions and using the GROUP BY clause—you’ll use them often—and that
you have a firm grasp on the numeric functions covered in this chapter. Several other
numeric functions exist, in case you ever need them. If you want to learn about these
other functions, you can check the MySQL documentation or the MariaDB documen‐
tation.